<?php
/*
虚拟机的安装
	所谓的虚拟机是可以在现有的操作系统上虚拟出一个新的硬件环境，相当于模拟了一台PC，以此实现在一台机器上正在同时运行俩个独立的操作系统。

	VMware是一个虚拟PC的软件，能让我们模拟虚拟机的功能。

	VMware特点：
		a. 无需分区或者重新开机就能在同一台电脑上使用俩种以上的操作系统。
		b. 本机系统可以与虚拟机系统进行网络通信。
		c. 可以设定并随时更改虚拟机操作系统的硬件环境。

	VMware7不支持win7，不支持64位操作系统，所以建议使用VMware8。
	
	快捷键：
		Ctrl-Alt-Enter    进入全屏模式

		ctrl+alt+insert      退出全屏

		Ctrl-Alt            返回正常（窗口）模式

		Ctrl-Alt-Tab      当鼠标和键盘焦点在虚拟机中时，在打开的虚拟机中切换。

		Ctrl-Tab           当鼠标和键盘焦点不在虚拟机中时，在打开的虚拟机中切换。VMware Workstation应用程序必须在活动应用状态上。

		Ctrl-Shift-Tab    当鼠标和键盘焦点不在虚拟机中时，在打开的虚拟机中切换。VMware Workstation应用程序必须在活动应用状态上。

		Ctrl-D               编辑虚拟机配置

		Ctrl-G               为虚拟机捕获鼠标和键盘焦点

		Ctrl-P               编辑参数

		Ctrl-F4              关闭所选择虚拟机的概要或者控制视图。如果虚拟机开着，一个确认对话框将出现。

		Ctrl-B               开机

		Ctrl-E               关机

		Ctrl-R               重启

		Ctrl-Z               挂起

		Ctrl-N               新建一个虚拟机

		Ctrl-O               打开一个虚拟机
 */